{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "???",
    "1": "ABR",
    "2": "AUX",
    "3": "B",
    "4": "C",
    "5": "CC",
    "6": "CD",
    "7": "CS",
    "8": "D",
    "9": "DS",
    "10": "DT",
    "11": "FW",
    "12": "G",
    "13": "GH",
    "14": "GVB",
    "15": "GVBB",
    "16": "GVBBS",
    "17": "GVBG",
    "18": "GVBI",
    "19": "GVBL",
    "20": "GVBLS",
    "21": "GVD",
    "22": "GVDC",
    "23": "GVDG",
    "24": "GVF",
    "25": "GVG",
    "26": "GVP",
    "27": "GVPC",
    "28": "GVPG",
    "29": "GVPI",
    "30": "GVPIS",
    "31": "GVPL",
    "32": "GVPM",
    "33": "GVPS",
    "34": "GVS",
    "35": "GVSI",
    "36": "GVX",
    "37": "I",
    "38": "INF",
    "39": "INTJ",
    "40": "IS",
    "41": "JJ",
    "42": "JJA",
    "43": "JJS",
    "44": "L",
    "45": "LS",
    "46": "M",
    "47": "MD",
    "48": "N",
    "49": "NB",
    "50": "NBS",
    "51": "NC",
    "52": "NCS",
    "53": "ND",
    "54": "NEG",
    "55": "NG",
    "56": "NGH",
    "57": "NGHB",
    "58": "NGHG",
    "59": "NGHL",
    "60": "NGHMS",
    "61": "NGS",
    "62": "NHM",
    "63": "NI",
    "64": "NIS",
    "65": "NL",
    "66": "NLS",
    "67": "NM",
    "68": "NMS",
    "69": "NP",
    "70": "NPB",
    "71": "NPBS",
    "72": "NPC",
    "73": "NPG",
    "74": "NPGS",
    "75": "NPL",
    "76": "NPLS",
    "77": "NPM",
    "78": "NPS",
    "79": "NS",
    "80": "NX",
    "81": "NXI",
    "82": "P",
    "83": "PJ",
    "84": "PN",
    "85": "POS",
    "86": "PR",
    "87": "PT",
    "88": "PUN",
    "89": "PY",
    "90": "QN",
    "91": "RB",
    "92": "RBA",
    "93": "RN",
    "94": "SRB",
    "95": "V",
    "96": "VB",
    "97": "VBB",
    "98": "VBC",
    "99": "VBG",
    "100": "VBL",
    "101": "VBLS",
    "102": "VBM",
    "103": "VBX",
    "104": "VBXC",
    "105": "VBXG",
    "106": "VD",
    "107": "VDB",
    "108": "VDC",
    "109": "VDCS",
    "110": "VDD",
    "111": "VDG",
    "112": "VDGH",
    "113": "VDGS",
    "114": "VDI",
    "115": "VDL",
    "116": "VDLS",
    "117": "VDS",
    "118": "VE",
    "119": "VF",
    "120": "VG",
    "121": "VP",
    "122": "VPB",
    "123": "VPCS",
    "124": "VPIS",
    "125": "VPX",
    "126": "VS",
    "127": "VSX"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "???": 0,
    "ABR": 1,
    "AUX": 2,
    "B": 3,
    "C": 4,
    "CC": 5,
    "CD": 6,
    "CS": 7,
    "D": 8,
    "DS": 9,
    "DT": 10,
    "FW": 11,
    "G": 12,
    "GH": 13,
    "GVB": 14,
    "GVBB": 15,
    "GVBBS": 16,
    "GVBG": 17,
    "GVBI": 18,
    "GVBL": 19,
    "GVBLS": 20,
    "GVD": 21,
    "GVDC": 22,
    "GVDG": 23,
    "GVF": 24,
    "GVG": 25,
    "GVP": 26,
    "GVPC": 27,
    "GVPG": 28,
    "GVPI": 29,
    "GVPIS": 30,
    "GVPL": 31,
    "GVPM": 32,
    "GVPS": 33,
    "GVS": 34,
    "GVSI": 35,
    "GVX": 36,
    "I": 37,
    "INF": 38,
    "INTJ": 39,
    "IS": 40,
    "JJ": 41,
    "JJA": 42,
    "JJS": 43,
    "L": 44,
    "LS": 45,
    "M": 46,
    "MD": 47,
    "N": 48,
    "NB": 49,
    "NBS": 50,
    "NC": 51,
    "NCS": 52,
    "ND": 53,
    "NEG": 54,
    "NG": 55,
    "NGH": 56,
    "NGHB": 57,
    "NGHG": 58,
    "NGHL": 59,
    "NGHMS": 60,
    "NGS": 61,
    "NHM": 62,
    "NI": 63,
    "NIS": 64,
    "NL": 65,
    "NLS": 66,
    "NM": 67,
    "NMS": 68,
    "NP": 69,
    "NPB": 70,
    "NPBS": 71,
    "NPC": 72,
    "NPG": 73,
    "NPGS": 74,
    "NPL": 75,
    "NPLS": 76,
    "NPM": 77,
    "NPS": 78,
    "NS": 79,
    "NX": 80,
    "NXI": 81,
    "P": 82,
    "PJ": 83,
    "PN": 84,
    "POS": 85,
    "PR": 86,
    "PT": 87,
    "PUN": 88,
    "PY": 89,
    "QN": 90,
    "RB": 91,
    "RBA": 92,
    "RN": 93,
    "SRB": 94,
    "V": 95,
    "VB": 96,
    "VBB": 97,
    "VBC": 98,
    "VBG": 99,
    "VBL": 100,
    "VBLS": 101,
    "VBM": 102,
    "VBX": 103,
    "VBXC": 104,
    "VBXG": 105,
    "VD": 106,
    "VDB": 107,
    "VDC": 108,
    "VDCS": 109,
    "VDD": 110,
    "VDG": 111,
    "VDGH": 112,
    "VDGS": 113,
    "VDI": 114,
    "VDL": 115,
    "VDLS": 116,
    "VDS": 117,
    "VE": 118,
    "VF": 119,
    "VG": 120,
    "VP": 121,
    "VPB": 122,
    "VPCS": 123,
    "VPIS": 124,
    "VPX": 125,
    "VS": 126,
    "VSX": 127
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
